##### working on titanic dataset

In [1]:
import pandas as pd
import numpy as np
from sklearn.feature_selection import SelectKBest
from sklearn.feature_selection import chi2

###### load the dataset through pandas and remove the features which are not strongly correlated to the target feature

In [2]:
df=pd.read_csv(r'C:\Users\navee\Downloads\titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
X=df.drop(columns=['PassengerId','Name'])

In [5]:
X.shape

(891, 10)

In [6]:
y=df['Survived']

In [7]:
y.shape

(891,)

##### ploting the heatmap which shows the correlation of the feature with the target feature

In [8]:
import matplotlib.pyplot as plt
import seaborn as sns
#get correlations of each features in dataset
corrmat = X.corr()
top_corr_features = corrmat.index
plt.figure(figsize=(20,20))
#plot heat map
g=sns.heatmap(X[top_corr_features].corr(),annot=True,cmap="RdYlGn")

##### handling the missing values in the dataset

In [9]:
X.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [10]:
X['Cabin']=X['Cabin'].astype(str).str[0]

In [11]:
X.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,n,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,n,S
3,1,1,female,35.0,1,0,113803,53.1000,C,S
4,0,3,male,35.0,0,0,373450,8.0500,n,S

In [12]:
X['Cabin']=np.where(X['Cabin']=='n','C',X['Cabin'])

In [13]:
X.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin         0
Embarked      2
dtype: int64

In [14]:
mean = X["Age"].mean()
std = X["Age"].std()
is_null = X["Age"].isnull().sum()
rand_age = np.random.randint(mean - std, mean + std, size = is_null)
rand_age

array([36, 18, 21, 35, 42, 27, 33, 32, 36, 40, 42, 19, 25, 29, 26, 31, 41,
       27, 35, 37, 39, 22, 38, 22, 27, 43, 23, 25, 28, 29, 30, 41, 17, 43,
       28, 34, 19, 17, 15, 29, 34, 25, 20, 43, 41, 40, 30, 34, 37, 20, 16,
       23, 37, 32, 17, 39, 43, 31, 17, 28, 27, 39, 20, 38, 33, 41, 39, 39,
       26, 24, 26, 24, 30, 15, 41, 34, 36, 19, 20, 32, 36, 37, 15, 30, 37,
       31, 31, 36, 42, 36, 25, 41, 24, 38, 42, 27, 21, 32, 22, 16, 40, 28,
       21, 16, 23, 19, 43, 35, 30, 43, 18, 20, 39, 19, 18, 39, 29, 36, 16,
       42, 41, 38, 19, 18, 23, 43, 19, 22, 29, 16, 41, 15, 41, 26, 39, 39,
       43, 36, 29, 15, 39, 33, 15, 43, 30, 42, 43, 41, 28, 31, 39, 24, 33,
       31, 40, 34, 19, 33, 28, 15, 32, 41, 28, 20, 23, 36, 43, 20, 38, 32,
       26, 33, 21, 32, 30, 38, 27])

In [15]:
age_slice = X["Age"].copy()
age_slice[np.isnan(age_slice)] = rand_age
X["Age"] = age_slice
X["Age"] = X["Age"].astype(int)

In [16]:
X['Embarked'].fillna(X['Embarked'],inplace=True)

In [17]:
X.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22,1,0,A/5 21171,7.2500,C,S
1,1,1,female,38,1,0,PC 17599,71.2833,C,C
2,1,3,female,26,0,0,STON/O2. 3101282,7.9250,C,S
3,1,1,female,35,1,0,113803,53.1000,C,S
4,0,3,male,35,0,0,373450,8.0500,C,S

In [18]:
X['relatives']=X['SibSp']+X['Parch']

In [19]:
X.drop(columns=['SibSp','Parch'],inplace=True)

In [20]:
X.drop(columns=['Ticket'],inplace=True)

In [21]:
X=pd.get_dummies(X,drop_first=True)

In [22]:
X.head()

,Survived,Pclass,Age,Fare,relatives,Sex_male,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Embarked_Q,Embarked_S
0,0,3,22,7.2500,1,1,0,1,0,0,0,0,0,0,1
1,1,1,38,71.2833,1,0,0,1,0,0,0,0,0,0,0
2,1,3,26,7.9250,0,0,0,1,0,0,0,0,0,0,1
3,1,1,35,53.1000,1,0,0,1,0,0,0,0,0,0,1
4,0,3,35,8.0500,0,1,0,1,0,0,0,0,0,0,1

##### using the random forest alogrithm for the traning of the model

In [23]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

In [24]:
X.drop(columns='Survived',inplace=True)

In [25]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=0)

In [26]:
clf=RandomForestClassifier(n_estimators=100, max_depth=3)

In [27]:
clf.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=3, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [28]:
##### checking the accuracy of the model

In [29]:
y_pred=clf.predict(X_test)

In [30]:
from sklearn.metrics import accuracy_score,classification_report,confusion_matrix

In [31]:
print(accuracy_score(y_test,y_pred,))
print(classification_report(y_test,y_pred,))
print(confusion_matrix(y_test,y_pred,))

0.8246268656716418
              precision    recall  f1-score   support

           0       0.79      0.98      0.87       168
           1       0.93      0.57      0.71       100

    accuracy                           0.82       268
   macro avg       0.86      0.77      0.79       268
weighted avg       0.85      0.82      0.81       268

[[164   4]
 [ 43  57]]